# Task 02 - Track B: Advanced DataFrame Operations

**Course:** Database Applications Development  
**Lesson:** 02 - Working with DataFrames (Preparing for SQL)  

---

## Instructions

Complete all exercises in this notebook. Track B includes significantly more practice with multiple conditions, chaining operations, and deeper analysis.

**Submission:**
1. Save this notebook as `dbAppsTask02TrackB.ipynb`
2. Add, commit, and push to your `databaseApplications` repository on GitHub
3. Verify the file appears correctly on GitHub

---

## Setup: Load the Dataset

In [1]:
# Import pandas and load data
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

# Quick check
print(titanic.shape)
titanic.head()

(1309, 14)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

---

## Part 1: Selecting Columns

### Exercise 1.1: Select Single Columns

Select and display the first 10 values:
1. The 'age' column
2. The 'fare' column

In [2]:
# Age column
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

print(titanic['age'].head(10))

0    29.00
1     0.92
2     2.00
3    30.00
4    25.00
5    48.00
6    63.00
7    39.00
8    53.00
9    71.00
Name: age, dtype: float64

In [3]:
# Fare column
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

print(titanic['age'].head(10))

0    29.00
1     0.92
2     2.00
3    30.00
4    25.00
5    48.00
6    63.00
7    39.00
8    53.00
9    71.00
Name: age, dtype: float64

### Exercise 1.2: Select Multiple Columns

Create a DataFrame called `passenger_info` with these columns: 'name', 'sex', 'age', 'survived'

Display the first 10 rows.

In [4]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

passenger_info = titanic[['name', 'sex', 'age', 'survived']]
print(passenger_info.head(10))

                                              name     sex    age  survived
0                    Allen, Miss. Elisabeth Walton  female  29.00         1
1                   Allison, Master. Hudson Trevor    male   0.92         1
2                     Allison, Miss. Helen Loraine  female   2.00         0
3             Allison, Mr. Hudson Joshua Creighton    male  30.00         0
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.00         0
5                              Anderson, Mr. Harry    male  48.00         1
6                Andrews, Miss. Kornelia Theodosia  female  63.00         1
7                           Andrews, Mr. Thomas Jr    male  39.00         0
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)  female  53.00         1
9                          Artagaveytia, Mr. Ramon    male  71.00         0

---

## Part 2: Filtering Rows

### Exercise 2.1: Filter by Survival

Create a DataFrame called `survivors` with only passengers who survived.

Print how many survivors there were.

In [5]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

survivors = titanic[titanic['survived'] == 1]

print("Number of survivors:", survivors)

Number of survivors:       pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
5          1         1                              Anderson, Mr. Harry
6          1         1                Andrews, Miss. Kornelia Theodosia
8          1         1    Appleton, Mrs. Edward Dale (Charlotte Lamson)
...      ...       ...                                              ...
1261       3         1                           Turkula, Mrs. (Hedwig)
1277       3         1                             Vartanian, Mr. David
1286       3         1  Whabee, Mrs. George Joseph (Shawneene Abi-Saab)
1290       3         1                 Wilkes, Mrs. James (Ellen Needs)
1300       3         1          Yasbeck, Mrs. Antoni (Selini Alexander)

         sex    age  sibsp  parch  ticket      fare    cabin embarked   boat  \
0     female  29.00      0      0   24160  211.3375       B5        S      2
1       male   0.92      1      2  113781  151.5500  C22 C26        S     11
5       male  48.00      0      0   19952   26.5500      E12        S      3
6     female  63.00      1      0   13502   77.9583       D7        S     10
8     female  53.00      2      0   11769   51.4792     C101        S      D
...      ...    ...    ...    ...     ...       ...      ...      ...    ...
1261  female  63.00      0      0    4134    9.5875      NaN        S     15
1277    male  22.00      0      0    2658    7.2250      NaN        C  13 15
1286  female  38.00      0      0    2688    7.2292      NaN        C      C
1290  female  47.00      1      0  363272    7.0000      NaN        S    NaN
1300  female  15.00      1      0    2659   14.4542      NaN        C    NaN

      body                        home.dest
0      NaN                     St Louis, MO
1      NaN  Montreal, PQ / Chesterville, ON
5      NaN                     New York, NY
6      NaN                       Hudson, NY
8      NaN              Bayside, Queens, NY
...    ...                              ...
1261   NaN                              NaN
1277   NaN                              NaN
1286   NaN                              NaN
1290   NaN                              NaN
1300   NaN                              NaN

[500 rows x 14 columns]

### Exercise 2.2: Filter by Gender

Create a DataFrame called `females` with only female passengers.

Print how many there were.

In [6]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

females = titanic[titanic['sex'] == 'female']
print(len(females))

466

### Exercise 2.3: Filter by Class

Create a DataFrame called `first_class` with only first class passengers.

Print how many there were.

In [7]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

fclass = titanic[titanic['pclass'] == 1]

print(len(fclass))

323

### Exercise 2.4: Filter by Age

Create a DataFrame called `children` with passengers 12 or younger.

Print how many there were.

In [8]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

young = titanic[titanic['age'] <= 12]

print(len(young))

94

---

## Part 3: Sorting Data

### Exercise 3.1: Sort by Age

Sort passengers by age and display name and age for the 10 youngest.

In [9]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

sort_by_age = titanic.sort_values('age')

### Exercise 3.2: Sort by Fare

Sort passengers by fare (highest first) and display name and fare for the top 10.

In [10]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

sort_by_fare = titanic.sort_values('fare')
print(sort_by_fare.head(10))

      pclass  survived                                   name   sex   age  \
1254       3         1           Tornquist, Mr. William Henry  male  25.0
528        2         0            Parkes, Mr. Francis "Frank"  male   NaN
581        2         0             Watson, Mr. Ennis Hastings  male   NaN
473        2         0                   Knight, Mr. Robert J  male   NaN
410        2         0       Frost, Mr. Anthony Wood "Archie"  male   NaN
363        2         0                  Campbell, Mr. William  male   NaN
70         1         0  Chisholm, Mr. Roderick Robert Crispin  male   NaN
384        2         0         Cunningham, Mr. Alfred Fleming  male   NaN
896        3         0                    Johnson, Mr. Alfred  male  49.0
898        3         0        Johnson, Mr. William Cahoone Jr  male  19.0

      sibsp  parch  ticket  fare cabin embarked boat  body  \
1254      0      0    LINE   0.0   NaN        S   15   NaN
528       0      0  239853   0.0   NaN        S  NaN   NaN
581       0      0  239856   0.0   NaN        S  NaN   NaN
473       0      0  239855   0.0   NaN        S  NaN   NaN
410       0      0  239854   0.0   NaN        S  NaN   NaN
363       0      0  239853   0.0   NaN        S  NaN   NaN
70        0      0  112051   0.0   NaN        S  NaN   NaN
384       0      0  239853   0.0   NaN        S  NaN   NaN
896       0      0    LINE   0.0   NaN        S  NaN   NaN
898       0      0    LINE   0.0   NaN        S  NaN   NaN

                         home.dest
1254                           NaN
528                        Belfast
581                        Belfast
473                        Belfast
410                        Belfast
363                        Belfast
70    Liverpool, England / Belfast
384                        Belfast
896                            NaN
898                            NaN

---

## Part 4: Statistics

### Exercise 4.1: Overall Statistics

Calculate and print:
1. Average age
2. Average fare
3. Maximum fare
4. Minimum age

In [11]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')
print("Average age:", titanic['age'].mean())
print("Average fare:", titanic['fare'].mean())
print("Maximum fare:", titanic['fare'].max())
print("Minimum age:", titanic['age'].min())

Average age: 29.881137667304014
Average fare: 33.29547928134557
Maximum fare: 512.3292
Minimum age: 0.17

### Exercise 4.2: Statistics on Filtered Data

Calculate:
1. Average age of survivors
2. Average fare of first class passengers

In [12]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

survivors = titanic[titanic['survived'] == 1]
fclass = titanic[titanic['pclass'] == 1]

print("Average age of survivors:", survivors['age'].mean())
print("Average fare of first class passengers:", fclass['fare'].mean())

Average age of survivors: 28.91824355971897
Average fare of first class passengers: 87.50899164086688

---

## Part 5: Value Counts

### Exercise 5.1: Count Values

Use `.value_counts()` to find:
1. How many in each class
2. How many male vs female
3. How many survived vs died

In [13]:
# Class counts
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')
print(titanic['pclass'].value_counts())

pclass
3    709
1    323
2    277
Name: count, dtype: int64

In [14]:
# Gender counts
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')
print(titanic['sex'].value_counts())

sex
male      843
female    466
Name: count, dtype: int64

In [15]:
# Survival counts
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')
print(titanic['survived'].value_counts())

survived
0    809
1    500
Name: count, dtype: int64

---

## Part 6: Multiple Condition Filtering (Track B)

Combine conditions using & (AND) and | (OR). Remember: each condition needs parentheses!

### Example: Combining Conditions

In [16]:
# AND (&) - Both conditions must be True
# Find male survivors
male_survivors = titanic[
    (titanic['sex'] == 'male') & 
    (titanic['survived'] == 1)
]
print(f"Male survivors: {len(male_survivors)}")

# OR (|) - At least one condition must be True
# Find first or second class passengers
upper_class = titanic[
    (titanic['pclass'] == 1) | 
    (titanic['pclass'] == 2)
]
print(f"Upper class passengers: {len(upper_class)}")

# CRITICAL: Each condition MUST have parentheses around it!

Male survivors: 161
Upper class passengers: 600

### Exercise 6.1: Female Survivors

Find all female passengers who survived.

How many were there?

In [17]:
# Your code here
# Hint: (titanic['sex'] == 'female') & (titanic['survived'] == 1)
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')
female_survived = titanic[(titanic['sex'] == 'female') & (titanic['survived'] == 1)]
print(len(female_survived))

339

### Exercise 6.2: Upper Class Passengers

Find passengers in either first OR second class.

How many were there?

In [18]:
# Your code here
# Hint: (titanic['pclass'] == 1) | (titanic['pclass'] == 2)
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')
ucp = titanic[(titanic['pclass'] == 1) | (titanic['pclass'] == 2)]
print(len(ucp))

600

### Exercise 6.3: Male First Class Survivors

Find male passengers in first class who survived.

Display name, age, and fare for all of them.

In [19]:
# Your code here (three conditions with &)
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')
mfcs = titanic[(titanic['sex'] == 'male') & (titanic['pclass'] == 1) & (titanic['survived'] == 1)]
print(mfcs[['name', 'age', 'fare']])

                                     name    age      fare
1          Allison, Master. Hudson Trevor   0.92  151.5500
5                     Anderson, Mr. Harry  48.00   26.5500
14   Barkworth, Mr. Algernon Henry Wilson  80.00   30.0000
20          Beckwith, Mr. Richard Leonard  37.00   52.5542
22                  Behr, Mr. Karl Howell  26.00   30.0000
..                                    ...    ...       ...
292              Taylor, Mr. Elmer Zebley  48.00   52.0000
295           Thayer, Mr. John Borland Jr  17.00  110.8833
298       Tucker, Mr. Gilbert Milligan Jr  31.00   28.5375
317       Williams, Mr. Richard Norris II  21.00   61.3792
320                     Woolner, Mr. Hugh    NaN   35.5000

[61 rows x 3 columns]

### Exercise 6.4: Children Who Survived

Find passengers who were 12 or younger AND survived.

How many children survived?

In [20]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

sc = titanic[(titanic['age'] <= 12) & (titanic['survived'] == 1)]
print(len(sc))

54

### Exercise 6.5: Expensive Tickets in Third Class

Find third class passengers who paid more than $20 for their fare.

How many were there? (This seems unusual - third class was cheap!)

In [21]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

etc = titanic[(titanic['pclass'] == 3) & (titanic['fare'] > 20)]
print(len(etc))

116

### Exercise 6.6: Complex Filter

Find passengers who meet ALL these conditions:
- Female
- Age between 20 and 40 (inclusive)
- Paid more than $30 fare

Display name, age, fare for the first 10.

In [22]:
# Your code here (four conditions!)
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

filt = titanic[
(titanic['sex'] == "female") &
(titanic['age'] >= 20) &
(titanic['age'] <= 40) &
(titanic['fare'] > 30)
]

print(filt[['name', 'age', 'fare']].head(10))

                                               name   age      fare
0                     Allen, Miss. Elisabeth Walton  29.0  211.3375
4   Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.0  151.5500
12                    Aubart, Mme. Leontine Pauline  24.0   69.3000
13                     Barber, Miss. Ellen "Nellie"  26.0   78.8500
18                            Bazzani, Miss. Albina  32.0   76.2917
24                                Bird, Miss. Ellen  29.0  221.7792
28                           Bissette, Miss. Amelia  35.0  135.6333
32                          Bonnell, Miss. Caroline  30.0  164.8667
36                      Bowerman, Miss. Elsie Edith  22.0   55.0000
57        Carter, Mrs. William Ernest (Lucile Polk)  36.0  120.0000

---

## Part 7: Advanced Sorting (Track B)

### Example: Sort by Multiple Columns

In [23]:
# Sort by class (ascending), then by fare within each class (descending)
sorted_df = titanic.sort_values(
    ['pclass', 'fare'],           # List of columns to sort by
    ascending=[True, False]        # True for ascending, False for descending
)

# Display name, class, and fare for first 20
print(sorted_df[['name', 'pclass', 'fare']].head(20))

# This groups by class first, then sorts by fare within each class

                                                  name  pclass      fare
49                  Cardeza, Mr. Thomas Drake Martinez       1  512.3292
50   Cardeza, Mrs. James Warburton Martinez (Charlo...       1  512.3292
183                             Lesurer, Mr. Gustave J       1  512.3292
302                                   Ward, Miss. Anna       1  512.3292
111                     Fortune, Miss. Alice Elizabeth       1  263.0000
112                         Fortune, Miss. Ethel Flora       1  263.0000
113                         Fortune, Miss. Mabel Helen       1  263.0000
114                     Fortune, Mr. Charles Alexander       1  263.0000
115                                  Fortune, Mr. Mark       1  263.0000
116                Fortune, Mrs. Mark (Mary McDougald)       1  263.0000
35                            Bowen, Miss. Grace Scott       1  262.3750
66                         Chaudanson, Miss. Victorine       1  262.3750
249                        Ryerson, Master. John Borie       1  262.3750
250                         Ryerson, Miss. Emily Borie       1  262.3750
251              Ryerson, Miss. Susan Parker "Suzette"       1  262.3750
252                         Ryerson, Mr. Arthur Larned       1  262.3750
253    Ryerson, Mrs. Arthur Larned (Emily Maria Borie)       1  262.3750
16                            Baxter, Mr. Quigg Edmond       1  247.5208
17     Baxter, Mrs. James (Helene DeLaudeniere Chaput)       1  247.5208
97   Douglas, Mrs. Frederick Charles (Mary Helene B...       1  247.5208

### Exercise 7.1: Sort by Multiple Columns

Sort passengers by class (ascending), then by fare within each class (descending).

Display name, pclass, fare for the first 20 rows.

In [24]:
# Your code here
# Hint: sort_values(['pclass', 'fare'], ascending=[True, False])
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

sort = titanic.sort_values(['pclass', 'fare'], ascending=[True, False])
print(sort[['name', 'pclass', 'fare']].head(20))

                                                  name  pclass      fare
49                  Cardeza, Mr. Thomas Drake Martinez       1  512.3292
50   Cardeza, Mrs. James Warburton Martinez (Charlo...       1  512.3292
183                             Lesurer, Mr. Gustave J       1  512.3292
302                                   Ward, Miss. Anna       1  512.3292
111                     Fortune, Miss. Alice Elizabeth       1  263.0000
112                         Fortune, Miss. Ethel Flora       1  263.0000
113                         Fortune, Miss. Mabel Helen       1  263.0000
114                     Fortune, Mr. Charles Alexander       1  263.0000
115                                  Fortune, Mr. Mark       1  263.0000
116                Fortune, Mrs. Mark (Mary McDougald)       1  263.0000
35                            Bowen, Miss. Grace Scott       1  262.3750
66                         Chaudanson, Miss. Victorine       1  262.3750
249                        Ryerson, Master. John Borie       1  262.3750
250                         Ryerson, Miss. Emily Borie       1  262.3750
251              Ryerson, Miss. Susan Parker "Suzette"       1  262.3750
252                         Ryerson, Mr. Arthur Larned       1  262.3750
253    Ryerson, Mrs. Arthur Larned (Emily Maria Borie)       1  262.3750
16                            Baxter, Mr. Quigg Edmond       1  247.5208
17     Baxter, Mrs. James (Helene DeLaudeniere Chaput)       1  247.5208
97   Douglas, Mrs. Frederick Charles (Mary Helene B...       1  247.5208

### Exercise 7.2: Who Paid the Least?

Find the 10 passengers who paid the lowest fares.

Display name, pclass, and fare.

In [25]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

sort = titanic.sort_values('fare', ascending=True)
print(sort[['name', 'pclass', 'fare']].head(10))

                                       name  pclass  fare
1254           Tornquist, Mr. William Henry       3   0.0
528             Parkes, Mr. Francis "Frank"       2   0.0
581              Watson, Mr. Ennis Hastings       2   0.0
473                    Knight, Mr. Robert J       2   0.0
410        Frost, Mr. Anthony Wood "Archie"       2   0.0
363                   Campbell, Mr. William       2   0.0
70    Chisholm, Mr. Roderick Robert Crispin       1   0.0
384          Cunningham, Mr. Alfred Fleming       2   0.0
896                     Johnson, Mr. Alfred       3   0.0
898         Johnson, Mr. William Cahoone Jr       3   0.0

### Exercise 7.3: Oldest in Each Class

Sort by class (ascending) and age (descending).

This groups each class together with oldest first. Display name, pclass, age for first 30.

In [26]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

sort = titanic.sort_values(['pclass', 'age'], ascending=[True, False])
print(sort[['name', 'pclass', 'age']].head(30))

                                                  name  pclass   age
14                Barkworth, Mr. Algernon Henry Wilson       1  80.0
61   Cavendish, Mrs. Tyrell William (Julia Florence...       1  76.0
9                              Artagaveytia, Mr. Ramon       1  71.0
135                          Goldschmidt, Mr. George B       1  71.0
81                        Crosby, Capt. Edward Gifford       1  70.0
285                                 Straus, Mr. Isidor       1  67.0
205                          Millet, Mr. Francis Davis       1  65.0
221                     Ostby, Mr. Engelhart Cornelius       1  65.0
78   Compton, Mrs. Alexander Taylor (Mary Eliza Ing...       1  64.0
83   Crosby, Mrs. Edward Gifford (Catherine Elizabe...       1  64.0
115                                  Fortune, Mr. Mark       1  64.0
217                       Nicholson, Mr. Arthur Ernest       1  64.0
303                           Warren, Mr. Frank Manley       1  64.0
6                    Andrews, Miss. Kornelia Theodosia       1  63.0
286             Straus, Mrs. Isidor (Rosalie Ida Blun)       1  63.0
279                          Stead, Mr. William Thomas       1  62.0
284          Stone, Mrs. George Nelson (Martha Evelyn)       1  62.0
321                                 Wright, Mr. George       1  62.0
252                         Ryerson, Mr. Arthur Larned       1  61.0
287                              Sutton, Mr. Frederick       1  61.0
300                          Van der hoef, Mr. Wyckoff       1  61.0
43     Bucknell, Mrs. William Robert (Emma Eliza Ward)       1  60.0
116                Fortune, Mrs. Mark (Mary McDougald)       1  60.0
123                   Frolicher-Stehli, Mr. Maxmillian       1  60.0
304   Warren, Mrs. Frank Manley (Anna Sophia Atkinson)       1  60.0
305                                    Weir, Col. John       1  60.0
42      Brown, Mrs. John Murray (Caroline Lane Lamson)       1  59.0
33                            Bonnell, Miss. Elizabeth       1  58.0
50   Cardeza, Mrs. James Warburton Martinez (Charlo...       1  58.0
139      Graham, Mrs. William Thompson (Edith Junkins)       1  58.0

---

## Part 8: Chaining Operations (Track B)

Combine filtering, selecting, and sorting in one statement.

### Example: Chaining Multiple Operations

In [27]:
# Chain: Filter → Select columns → Sort → Display
result = titanic[
    titanic['survived'] == 1                    # Step 1: Filter for survivors
][['name', 'age', 'pclass']                     # Step 2: Select specific columns
].sort_values('age'                             # Step 3: Sort by age
).head(10)                                       # Step 4: Get first 10

print(result)

# This gets the 10 youngest survivors with their name, age, and class

                                         name   age  pclass
763   Dean, Miss. Elizabeth Gladys "Millvina"  0.17       3
1240          Thomas, Master. Assad Alexander  0.42       3
427                 Hamalainen, Master. Viljo  0.67       2
658             Baclini, Miss. Helene Barbara  0.75       3
657                    Baclini, Miss. Eugenie  0.75       3
611                 Aks, Master. Philip Frank  0.83       3
359             Caldwell, Master. Alden Gates  0.83       2
548           Richards, Master. George Sibley  0.83       2
590                     West, Miss. Barbara J  0.92       2
1              Allison, Master. Hudson Trevor  0.92       1

### Exercise 8.1: Female Survivors by Age

Chain operations to:
1. Filter for female survivors
2. Select name, age, pclass columns
3. Sort by age
4. Display first 10

In [28]:
# Your code here (one long chain!)
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

result = titanic[
titanic['sex'] == "female"
][['name', 'age', 'pclass']
].sort_values('age'
             )

print(result.head(10))

                                         name   age  pclass
763   Dean, Miss. Elizabeth Gladys "Millvina"  0.17       3
657                    Baclini, Miss. Eugenie  0.75       3
658             Baclini, Miss. Helene Barbara  0.75       3
590                     West, Miss. Barbara J  0.92       2
937              Klasen, Miss. Gertrud Emilia  1.00       3
1187          Sandstrom, Miss. Beatrice Irene  1.00       3
895              Johnson, Miss. Eleanor Ileen  1.00       3
1048              Nakid, Miss. Maria ("Mary")  1.00       3
478                     Laroche, Miss. Louise  1.00       2
866                  Hirvonen, Miss. Hildur E  2.00       3

### Exercise 8.2: First Class by Fare

Chain operations to:
1. Filter for first class
2. Select name, age, fare
3. Sort by fare (highest first)
4. Display first 15

In [29]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

result = titanic[titanic['pclass'] == 1][['name', 'age', 'fare']].sort_values('fare', ascending=False)
print(result.head(15))

                                                  name   age      fare
302                                   Ward, Miss. Anna  35.0  512.3292
49                  Cardeza, Mr. Thomas Drake Martinez  36.0  512.3292
183                             Lesurer, Mr. Gustave J  35.0  512.3292
50   Cardeza, Mrs. James Warburton Martinez (Charlo...  58.0  512.3292
115                                  Fortune, Mr. Mark  64.0  263.0000
116                Fortune, Mrs. Mark (Mary McDougald)  60.0  263.0000
111                     Fortune, Miss. Alice Elizabeth  24.0  263.0000
113                         Fortune, Miss. Mabel Helen  23.0  263.0000
112                         Fortune, Miss. Ethel Flora  28.0  263.0000
114                     Fortune, Mr. Charles Alexander  19.0  263.0000
250                         Ryerson, Miss. Emily Borie  18.0  262.3750
253    Ryerson, Mrs. Arthur Larned (Emily Maria Borie)  48.0  262.3750
35                            Bowen, Miss. Grace Scott  45.0  262.3750
66                         Chaudanson, Miss. Victorine  36.0  262.3750
251              Ryerson, Miss. Susan Parker "Suzette"  21.0  262.3750

### Exercise 8.3: Young Male Survivors

Chain operations to:
1. Filter for males under 18 who survived
2. Select name, age, pclass
3. Sort by age (youngest first)
4. Display all

In [30]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

result = titanic[(titanic['sex'] == "male") & (titanic['age'] < 18)][['name', 'age', 'pclass']].sort_values('age', ascending=True)
print(result)

                                         name    age  pclass
747   Danbom, Master. Gilbert Sigvard Emanuel   0.33       3
1240          Thomas, Master. Assad Alexander   0.42       3
427                 Hamalainen, Master. Viljo   0.67       2
1111           Peacock, Master. Alfred Edward   0.75       3
548           Richards, Master. George Sibley   0.83       2
...                                       ...    ...     ...
740                       Culumovic, Mr. Jeso  17.00       3
772                           Dika, Mr. Mirko  17.00       3
700                           Calic, Mr. Jovo  17.00       3
885                 Jensen, Mr. Svend Lauritz  17.00       3
1133                        Pokrnic, Mr. Mate  17.00       3

[82 rows x 3 columns]

---

## Part 9: Extended Statistics (Track B)

### Example: Statistics by Subgroups

In [31]:
# Calculate statistics for different subgroups

# Average fare for first class
first_class = titanic[titanic['pclass'] == 1]
avg_first_fare = first_class['fare'].mean()
print(f"First class average fare: ${avg_first_fare:.2f}")

# Average fare for third class
third_class = titanic[titanic['pclass'] == 3]
avg_third_fare = third_class['fare'].mean()
print(f"Third class average fare: ${avg_third_fare:.2f}")

# Compare the two
print(f"Difference: ${avg_first_fare - avg_third_fare:.2f}")

First class average fare: $87.51
Third class average fare: $13.30
Difference: $74.21

### Exercise 9.1: Statistics by Class

Calculate the average fare for each class separately.

Which class paid the most on average?

In [32]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

first_class = titanic[titanic['pclass'] == 1]
print("First class average fare:", first_class['fare'].mean())

second_class = titanic[titanic['pclass'] == 2]
print("Second class average fare:", second_class['fare'].mean())

third_class = titanic[titanic['pclass'] == 3]
print("Third class average fare:", third_class['fare'].mean())

First class average fare: 87.50899164086688
Second class average fare: 21.179196389891697
Third class average fare: 13.302888700564973

### Exercise 9.2: Survival Rates by Gender

Calculate the percentage of males who survived and the percentage of females who survived.

Which gender had a higher survival rate?

In [33]:
# Your code here

import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

male = titanic[titanic['sex'] == 'male']
male_rate = len(male[male['survived'] == 1]) / len(male)
print("Male survival rate:", male_rate)

female = titanic[titanic['sex'] == 'female']
female_rate = len(female[female['survived'] == 1]) / len(female)
print("Female survival rate:", female_rate)

Male survival rate: 0.19098457888493475
Female survival rate: 0.7274678111587983

### Exercise 9.3: Age Statistics by Survival

Calculate:
1. Average age of survivors
2. Average age of non-survivors
3. Who was older on average?

In [34]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

survivors = titanic[titanic['survived'] == 1]
print("Average age of survivors:", survivors['age'].mean())

non_survivors = titanic[titanic['survived'] == 0]
print("Average age of non survivors:", survivors['age'].mean())

Average age of survivors: 28.91824355971897
Average age of non survivors: 28.91824355971897

---

## Part 10: Analysis Questions

### Question 1: Survival Rate

What percentage of passengers survived?

In [35]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

survival_rate = len(titanic[titanic['survived'] == 1]) / len(titanic)
print("Percentage survived:", survival_rate)

Percentage survived: 0.3819709702062643

**Answer:** 38%

### Question 2: Class Distribution

Which class had the most passengers?

In [36]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

first_class = len(titanic[titanic['pclass'] == 1])
print("First class passengers:", first_class)

second_class = len(titanic[titanic['pclass'] == 2])
print("Second class passengers:", second_class)

third_class = len(titanic[titanic['pclass'] == 3])
print("Third class passengers:", third_class)

First class passengers: 323
Second class passengers: 277
Third class passengers: 709

**Answer:** Third Class

### Question 3: Age Comparison

What was the average age of first class vs third class passengers?

In [37]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

first_class_age = titanic[titanic['pclass'] == 1]['age'].mean()
print("Average age of first class:", first_class_age)

third_class_age = titanic[titanic['pclass'] == 3]['age'].mean()
print("Average age of third class:", third_class_age)

Average age of first class: 39.15992957746479
Average age of third class: 24.81636726546906

**Answer:**  First class

### Question 4: Gender Distribution

Were there more male or female passengers?

In [38]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

male = titanic[titanic['sex'] == "male"]
print("Male passengers:", len(male))

female = titanic[titanic['sex'] == "female"]
print("Female passengers:", len(female))

Male passengers: 843
Female passengers: 466

**Answer:** Male

### Question 5: Fare Comparison

Did survivors pay more on average than non-survivors?

In [39]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

survivors = titanic[titanic['survived'] == 1]['fare'].mean()
print("Survivor fare:", survivors)

non_survivors = titanic[titanic['survived'] == 0]['fare'].mean()
print("Non survivor fare:", non_survivors)

Survivor fare: 49.361183600000004
Non survivor fare: 23.353830569306933

**Answer:** Survivors

### Question 6: Child Survival Rate

What percentage of children (age <= 12) survived compared to adults (age > 12)?

In [40]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

children_survived = titanic[(titanic['age'] <= 12) & (titanic['survived'] == 1)]
print("Children survived:", len(children_survived))

adults_survived = titanic[(titanic['age'] > 12) & (titanic['survived'] == 1)]
print("Adults survived:", len(adults_survived))

Children survived: 54
Adults survived: 373

**Answer:** Adults

### Question 7: Fare and Survival

Did survivors pay higher fares on average than non-survivors? Why might this be?

In [41]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

survivor_fare = titanic[titanic['survived'] == 1]['fare'].mean()
print("Survivor fare:", survivor_fare)

nonsurvivor_fare = titanic[titanic['survived'] == 0]['fare'].mean()
print("Non survivor fare:", nonsurvivor_fare)

Survivor fare: 49.361183600000004
Non survivor fare: 23.353830569306933

**Answer:** Survivor, because they likely were high class, and had priority to life boats

### Question 8: Class Survival Rates

Calculate the survival rate for each class (1st, 2nd, 3rd). Which class had the highest survival rate?

In [42]:
# Your code here
import pandas as pd

titanic = pd.read_csv('Titanic_Dataset.csv')

first_class = titanic[titanic['pclass'] == 1]
first_class_rate = len(first_class[first_class['survived'] == 1]) / len(first_class)
print("First class rate:", first_class_rate)

second_class = titanic[titanic['pclass'] == 2]
second_class_rate = len(second_class[second_class['survived'] == 1]) / len(second_class)
print("Second class rate:", second_class_rate)

third_class = titanic[titanic['pclass'] == 3]
third_class_rate = len(third_class[third_class['survived'] == 1]) / len(third_class)
print("Third class rate:", third_class_rate)

First class rate: 0.6191950464396285
Second class rate: 0.4296028880866426
Third class rate: 0.2552891396332863

**Answer:** First class

---

## Part 11: Critical Thinking (Track B)

### Question 9: Important Factors

Based on your analysis, what were the THREE most important factors for survival?

Support with specific statistics.

**Your Answer:**

1. Class, because first class would have priority 
2. Age, as adults would have a much higher survival rate
3. Fare, as maybe spending more would result in some sort of emergency guarantee

### Question 10: Pandas to SQL

You filtered with: `titanic[(titanic['sex'] == 'female') & (titanic['survived'] == 1)]`

How do you think this might look in SQL? (Guess - we'll learn this next!)

**Your Answer:** I don't know, I'd assume the same way.

---

## Submission Checklist

- [ ] Completed all exercises including Track B sections
- [ ] Run all cells successfully
- [ ] Added name and date at top
- [ ] Answered all questions
- [ ] Saved as `dbAppsTask02TrackB.ipynb`
- [ ] Pushed to GitHub

**Excellent work! You're ready for SQL!**